{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Формат входных данных\n",
    "#На вход программе подаются две строки текста, содержащие по одному слову из перечня \"камень\", \"ножницы\", \"бумага\", \"ящерица\" или \"Спок\". \n",
    "#На первой строке записан выбор Тимура, на второй – выбор Руслана.\n",
    "\n",
    "#Формат выходных данных\n",
    "#Программа должна вывести результат жеребьёвки: кто победил - Тимур или Руслан, или они сыграли вничью.\n",
    "\n",
    "\n",
    "timur=input()\n",
    "ruslan=input()\n",
    "if timur==ruslan:\n",
    "    print('ничья')\n",
    "else:\n",
    "    камень={'ножницы':True,\n",
    "            'бумага':False,\n",
    "            'ящерица':True,\n",
    "            'Спок':False}\n",
    "    ножницы={'камень':False,\n",
    "            'бумага':True,\n",
    "            'ящерица':True,\n",
    "            'Спок':False}\n",
    "    бумага={'камень':True,\n",
    "            'ножницы':False,\n",
    "            'ящерица':False,\n",
    "            'Спок':True}\n",
    "    спок={'камень':True,\n",
    "            'ножницы':True,\n",
    "            'бумага':False,\n",
    "            'ящерица':False}\n",
    "    ящерица={'Камень':False,\n",
    "            'ножницы':False,\n",
    "            'Спок':True,\n",
    "            'бумага':True}\n",
    "    g=''\n",
    "    T={'камень':камень,\n",
    "        'ножницы':ножницы,\n",
    "        'бумага':бумага,\n",
    "        'Спок':спок,\n",
    "        'ящерица':ящерица}\n",
    "    for rus in T[timur]:\n",
    "        if rus==ruslan and T[timur][rus]==True:\n",
    "            g='Тимур'\n",
    "    if g=='':\n",
    "        g='Руслан'\n",
    "    print(g)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.12.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
