{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "роскомнадзор запретил букву а\n",
      "роскомндзор зпретил букву б\n",
      "роскомндзор зпретил укву в\n",
      "роскомндзор зпретил уку д\n",
      "роскомнзор зпретил уку е\n",
      "роскомнзор зпртил уку з\n",
      "роскомнор пртил уку и\n",
      "роскомнор пртл уку к\n",
      "росомнор пртл уу л\n",
      "росомнор прт уу м\n",
      "росонор прт уу н\n",
      "росоор прт уу о\n",
      "рср прт уу п\n",
      "рср рт уу р\n",
      "с т уу с\n",
      "т уу т\n",
      "уу у\n"
     ]
    }
   ],
   "source": [
    "#Необходимо написать программу, реализующую алгоритм написания этой песни. Алгоритм выводит в конце предложения следующую в алфавитном порядке букву,\n",
    "# если она встречается в строке текста, а очередную строку отображает уже без этой буквы.\n",
    "\n",
    "#Формат входных данных\n",
    "#На вход программе подается одно слово, записанное строчными русскими буквами без буквы \"ё\"\n",
    "\n",
    "#Формат выходных данных\n",
    "#Программа должна вывести в соответствии с указанным алгоритмом строки,\n",
    "#количество которых равно количеству разных букв в строке, которая получается путем конкатенации введенного слова и строки \"запретил букву\".\n",
    "\n",
    "word=input()\n",
    "k=' запретил букву '\n",
    "c=word+k\n",
    "q=sorted(set(c))\n",
    "q.remove(' ')\n",
    "c=c+q[0]\n",
    "for i in range(len(q)-1):\n",
    "    if q[i] in c:\n",
    "        print(c)\n",
    "        word=word.translate({ord(q[i]):None})\n",
    "        k=k.translate({ord(q[i]):None})\n",
    "        c=word+k+q[i+1]   \n",
    "        c=c.lstrip().replace('  ',' ')\n",
    "c=c.replace('  ',' ')\n",
    "print(c)\n",
    "        \n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
